{"id":413,"date":"2020-12-07T02:41:58","date_gmt":"2020-12-06T20:41:58","guid":{"rendered":"https:\/\/rents.com.bd\/?page_id=413"},"modified":"2020-12-07T03:26:41","modified_gmt":"2020-12-06T21:26:41","slug":"terms-and-condition","status":"publish","type":"page","link":"https:\/\/rents.com.bd\/terms-and-condition\/","title":{"rendered":"Terms and Condition"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"413\" class=\"elementor elementor-413\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-0aeb9f2 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"0aeb9f2\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-12db3cf\" data-id=\"12db3cf\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-7bcdccc elementor-widget elementor-widget-text-editor\" data-id=\"7bcdccc\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<h3>Terms &amp; Conditions for the use of our website<\/h3><p><strong>These terms and conditions govern your use of this website. By using this website, you accept these terms and conditions in full.<\/strong><\/p><p>If you disagree with these terms and conditions, or any part of these terms and conditions, you MUST NOT use this website.<\/p><h3>Cookies<\/h3><p>This website uses cookies. By using this website and agreeing to these terms and conditions, you consent to Rents.com.bd use of cookies in accordance with the terms of Rents.com.bd privacy policy and cookies policy.<\/p><h3>License to use website<\/h3><p>Unless otherwise stated, Rents.com.bd and\/or its licensors own all intellectual property rights contained within this website, and all material on the website. Subject to the license below, all these intellectual property rights are reserved.<\/p><p>You may view, download for caching purposes only, and print pages [or other content] from the website for your own personal use, subject to the restrictions set out below and elsewhere in these terms and conditions.<\/p><h3>Acceptable use <small>You MUST NOT:<\/small><\/h3><ul><li>• Republish material from this website in any form, including reproduction on any other website.<\/li><li>•Sell, rent or sub-license any material from this website.<\/li><li>• Present or reproduce any material from this website in public, either on or offline.<\/li><li>•Reproduce, duplicate, copy or otherwise exploit material on this website for any commercial purposes.<\/li><li>•Edit or otherwise modify any material on the website for any purposes.<\/li><li>•Redistribute material from this website, except for content where consent has been expressly made for specific redistribution. Where content is specifically made available for redistribution and consent is given for redistribution for these purposes, it may only be redistributed by you\/your company under the conditions set out in the terms set by the Rents.com.bd<\/li><li>• Use this website to copy, store, host, transmit, send, use, publish or distribute any material which consists of, or is linked to, any spyware, computer virus, Trojan horse, worm, keystroke logger, rootkit or other malicious computer software.<\/li><li>• Use this website in any way that causes, or may cause, damage to the website or impairment of the availability or accessibility of the website; or in any way that is unlawful, illegal, fraudulent or harmful, or in connection with any unlawful, illegal, fraudulent or harmful purpose or activity.<\/li><li>• Conduct any systematic or automated data collection activities (including, but not limited to, scraping, data mining, data extraction and data harvesting) on, or in relation to this website, without the express written consent of Rents.com.bd<\/li><\/ul><h2>Restricted access<\/h2><p>Access to certain areas of this website is restricted. Rents.com.bd reserves the right to restrict access to this and to any other areas of this website, or indeed this entire website, at the discretion of the Rents.com.bd<\/p><h3>User-generated content<\/h3><p>In these terms and conditions, “your user content” means any material (including, but not limited to, images, audio material, video material and audio-visual material) that you submit to this website, for whatever purpose. You grant to the Rents.com.bd a worldwide, irrevocable, non-exclusive, royalty-free license to use, reproduce, adapt, publish, translate and distribute your user content in any existing or future media. You also grant to the Rents.com.bd the right to sub-license these rights, and the right to bring an action for infringement of these rights.<\/p><p>Your user content must not be illegal or unlawful, must not infringe any third party’s legal rights, and must not be capable of giving rise to legal action whether against you or the Rents.com.bd or a third party (in each case under any applicable law).<\/p><p>You must not submit any user content to the website that is, or has ever been, the subject of any legal proceedings, threatened or actual, or other official complaint.<\/p><p>Rents.com.bd reserves the right to edit or remove any material submitted to this website, or stored on the Rents.com.bd servers, or hosted or published upon this website.<\/p><p>Notwithstanding the Rents.com.bd rights under these terms and conditions relating to user content, the Rents.com.bd does not monitor the submission of such content to, or the publication of such content on, this website.<\/p><h2>No warranties<\/h2><p>This website is provided in its current form, without any representations or warranties, either express or implied. Rents.com.bd makes no representations or warranties in relation to this website, or any of the information and materials provided on this website.<\/p><p><br \/>In addition, Rents.com.bd does not provide any warranty that:<br \/>• This website will be constantly available, or available at all<br \/>• The information on this website is complete, true, accurate or not misleading<\/p><p>The content on this website does not constitute, and is not intended to constitute, advice of any kind. If you require advice in on any legal, financial or medical matter, you should always consult an appropriate professional. We provide details of any relevant professionals advisers where required.<\/p><h2>Limitations of liability<\/h2><p>Rents.com.bd will not have any liability towards you (under the law of contact, law of torts or otherwise) in relation to content contained within, or the use of, or otherwise in connection with, this website:<br \/>• To the extent that the website is provided free-of-charge, for any direct loss;<br \/>• For any indirect, special or consequential loss; or<br \/>• For any business losses, loss of revenue, income, profits or anticipated savings, loss of contracts or business relationships, loss of reputation or goodwill, or loss or corruption of information or data.<br \/>• These limitations of liability apply even if the Rents Inc. has been expressly advised of the potential loss.<\/p><h2>Exceptions<\/h2><p>This website disclaimer and all its content will not exclude or limit any legal warranty implied that would be unlawful to exclude or limit. This website disclaimer does not exclude or limit the liability of the Rents.com.bd regarding any:<br \/>• Death or personal injury caused by negligence for which the Rents.com.bd is liable<br \/>• Any matter which it would be illegal or unlawful for the Rents Inc. to exclude or limit, or to attempt or purport to exclude or limit, its liability<br \/>• By using this website, you agree that the exclusions and limitations of liability set out in this website disclaimer are reasonable. If you do not deem these terms reasonable, you must not use this website.<\/p><h2>Unenforceable provisions<\/h2><p>If any provision of this website disclaimer is, or is found to be, unenforceable under applicable law, that will not affect the enforceability of the other provisions of this website disclaimer.<\/p><h2>Indemnity<\/h2><p>You hereby indemnify the Rents.com.bd and undertake to keep Rents.com.bd indemnified against any losses, damages, costs, liabilities and expenses (including without limitation legal expenses and any amounts paid by Rents.com.bd to a third party in settlement of a claim or dispute on the advice of Rents.com.bd’s legal advisers incurred or suffered by Rents.com.bd arising out of any breach by you of any provision of these terms and conditions, or arising out of any claim that you have breached any provision of these terms and conditions). Breaches of these terms and conditions<\/p><p>Without prejudice to the Rents.com.bd other rights under these terms and conditions, if you breach these terms and conditions in any way, we may take such action as deemed appropriate to deal with the breach, including suspending your access to the website, prohibiting you from accessing the website, blocking computers using your IP address from accessing the website, contacting your internet service provider to request that they block your access to the website and\/or bringing court proceedings against you.<\/p><h2>Variation<\/h2><p>Rents.com.bd may revise these terms and conditions periodically. Revised terms and conditions will apply to the use of this website once the revised terms and conditions appear live on this website. Please check this page regularly to ensure you are familiar with the current version.<\/p><h2>Assignment<\/h2><p>The deemed may transfer, sub-contract or otherwise deal with Rents.com.bd rights and\/or obligations under these terms and conditions without notifying you or obtaining your consent. You may not transfer, sub-contract or otherwise deal with your rights and\/or obligations under these terms and conditions.<\/p><h2>Severability<\/h2><p>If a provision of these terms and conditions is determined by any court or other competent authority to be unlawful and\/or unenforceable, the other provisions will continue in effect. If any unlawful and\/or unenforceable provision would be lawful or enforceable if part of it were deleted, that part will be deemed to be deleted, and the rest of the provision will continue in effect.<\/p><h2>Entire agreement<\/h2><p>These terms and conditions constitute the entire agreement between you and Rents.com.bd in relation to your use of this website, and supersede all previous agreements in respect of your use of this website.<\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Terms &amp; Conditions for the use of our website These terms and conditions govern your use of this website. By using this website, you accept these terms and conditions in full. If you disagree with these terms and conditions, or any part of these terms and conditions, you MUST NOT use this website. Cookies This [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"elementor_header_footer","meta":[],"_links":{"self":[{"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/pages\/413"}],"collection":[{"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/comments?post=413"}],"version-history":[{"count":0,"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/pages\/413\/revisions"}],"wp:attachment":[{"href":"https:\/\/rents.com.bd\/wp-json\/wp\/v2\/media?parent=413"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}